
<div class="art-layout-cell art-content clearfix"><div class="art-content-layout-wrapper post-layout-item-0">
	<div class="art-content-layout">
    	<div class="art-content-layout-row">
    		<div class="art-layout-cell post-layout-item-1" style="width: 100%">
        		<article class="art-post art-article">
                   <h2 class="art-postheader">
                  		<span class="art-postheadericon"><a href="#">Веб-редактор Codelobster</a></span>
                   </h2>

    
                	
  <article>              	  
            	<div class="art-postcontent art-postcontent-0 clearfix">
        			<div class="art-content-layout">
        				<div class="art-content-layout-row">
        					<div class="art-layout-cell layout-item-0" style="width: 100%">
        						<h3 style="border-bottom: 1px solid #A9BCC1; padding-bottom: 5px">Чем хорош данный редактор?</h3>
        							
        							<div class="clearfix">
        								
       									 
             <div class="">
        <div class="image-caption-wrapper" style="width: 50%; float: left"><img src="images/logo.png" style="width: 50%; max-width:300px" alt="an image" class="sba-lightbox">
        
    
        
        </div></div></div>
        							
    <p><span style="font-weight: bold;">Существует множество веб-редакторов.</span><br/>
    Сегодня я хочу рассказать об одном из них.
     А именно Веб-редактор <span style="font-weight: bold;">Сodelobster</span><br/>
      Данный редактор достаточно очень мощная среда программирования К сожалению совместимо только с операционной системой indows.  Функционал редактор очень высокий. На нём можно делать достаточно сложные проекты.  Редактор codelobster можно скачать с официального сайта.  Поставляются в 3 версиях версия free, light и professional.  Free это свободно распространяемое версия. Но она имеет очень небольшой функционал. Для нормальной работы Я советую пользоваться версией Light.  Более подробно о различие версий Вы можете прочитать на сайте http://codelobster.com//. Вкратце скажу что версия Light вполне достаточно для работы. Профессиональная версия стоит гораздо дороже и главное отличие от версии Light  это автодополнение кода функций в CMS движках и фреймворках.</p>
     
        <ul>
       	 	<li><span style="font-weight: bold;">После того как вы скачаете этот редактор откроется небольшое окно при первом запуске где вам предложат бесплатно зарегистрировать свою версию. Если вы покупали данную программу  то в открывшемся окне введите ваш серийный номер.</span><br>
       	  <img border="0" src="images/cl1.png" class="foc" tabindex="1"/> 	
        Для начала давайте произведем базовые настройки программы. Сначала Давайте разберемся с окнами. codelobster имеет очень много окон. Все их мы будем разбирать по отдельности.</li>
        	<li><span style="font-weight: bold;">Все окна состоят из вкладок. Чтобы передвинуть окно, зажмите левой клавишей мыши его верхнюю часть и не отпуская перетащите в необходимом направлении. Как только Вы начнете перетаскивать, сразу появятся небольшие стрелки по краям и в центре экрана. Чтобы зафиксировать окно, необходимо подвести курсор и нажать соответствующую  стрелку. В зависимости от того куда Вы нажали, окно будет перекрывать или прилипать к соседнему. Возможно также его полностью поместить внутри другого.</span></li>
        </ul>
        					</div>
       					 </div>
       				 </div><br><a href="#">Далее...</a>
                 	</div>
        		</article>
   		 	</div>
   		 </div>
	</div>
</div>

<div class="art-content-layout-wrapper post-layout-item-0">
<div class="art-content-layout">
    <div class="art-content-layout-row">
    <div class="art-layout-cell post-layout-item-1" style="width: 100%">
        <article class="art-post art-article">
        <h2 class="art-postheader"><span class="art-postheadericon"><a href="Blog Posts/new-post-1.html">Аналогичную процедуру можно сделать и с отдельными  вкладками</a>
                                        </span></h2>
                                        <div class="art-postcontent art-postcontent-1 clearfix">
        <div class="art-content-layout">
        <div class="art-content-layout-row">
        <div class="art-layout-cell layout-item-0" style="width: 100%">
        <p> Чтобы открыть закрытое окно, щелкните правой кнопкой мыши по свободной части стола. Поставьте или уберите галочку.
Теперь давайте перейдем к панели инструментов. codelobster имеет три панели и верхнее меню. Очень жаль, что мы не можем добавить свои кнопки, поэтому приходится я обходится текущими. 
1.	Main Toolbar – стандартная  панель  для основных действий (открыть, сохранить и т.д.)
2.	HTML Toolbar - HTML панель  для вставки HTML тегов
3.	Debug  Toolbar – панель отладки PHP кода.
Также как окна или вкладки мы можем передвигать панель инструментов или спрятать ее.
Настройте свой рабочий стол по своему вкусу. Я например убираю все окна и панель инструментов  Debug  Toolbar, оставив только левое окно с ее вкладками. Остальные вкладки открываю  по мере необходимости.
Давайте сделаем еще несколько настроек.
Зайдите в Меню ->Инструменты -> Настройки
Здесь Вы можете настроить веб-редактор по своему вкусу.
1.	FTP – для этой настройки есть отдельный урок
2.	IDE – очень  важный пункт, рассмотрим его под-меню
•	HotKeys – Можно назначить свои клавиши, как отдельным тегам, так и различным действиям
•	Основные – Здесь главное поставить кодировку utf-8 по молчанию. Остальное, оставьте все как есть, или сделайте как у меня.
•	Портативность – У меня нет информации по этому пункту, так как я не работаю с мобильной версией
•	Проект – это те файлы, которые будут отображаться в вашем проекте.
•	Файлы – типы файлов, при нажатии на которые в Windows, будут автоматически открываться в редакторе codelobster.
3.	Контроль версий – у меня нет информации по данному пункту
4.	Отладчик – смотрите урок Отладка PHP кода
5.	Помощь – Если Вы выделите какую-нибудь  функцию или тег и нажмете клавишу F1, Вас перенаправят на соответствующий  адрес в интернете. Но можно загрузить свою документацию и поменять настройки.
6.	Редактор – Настройте шрифт, отступы и т.п. по своему вкусу
	Цвета – Здесь выбирается цветовая схема.  Можно поменять не только всю схему, но и отдельные операторы.
7.	Сниппеты – смотрите урок Сниппеты.
8.	Форматирование – Вы можете настроить формат кода на свой вкус. Для этого выделите свой код, который необходимо отформатировать (можно выделить всю страницу), и нажмите клавишу CTRL+ALT+F
Еще несколько полезных советов.
Если Вы хотите закомментировать свой код можно воспользоваться «горячими клавишами».
Для этого необходимо выделить весь код , и нажать соответствующую клавишу.
Еще одна полезная функция  - это закладки. Нажмите Правка -> Закладки -> Установить закладку
У вас появится закладка в том месте,  где находится курсор. Далее щелкните правой кнопкой мыши вне рабочей области и выберите вкладку Закладки.
В этом окне будут отображаться все закладки Вашего проекта.  Закладки можно удалять, переименовывать и переходить к ним одним кликом.
Если у Вас пропало окно с подсказками, подведите курсор к необходимому  месту и нажмите  CTRL+Space .
В заключение я хочу  предоставить Вам список самых необходимых рабочих клавиш, которые можно переопределить в настройках редактора.
1.	CTRL+Z отменить последнее действие
2.	CTRL+Y вернуть отмененное действие
3.	CTRL+A Выделить всю страницу целиком
4.	CTRL+D продублировать выделенный абзац
5.	CTRL+S сохранить страницу
6.	CTRL+Shift+S сохранить все открытые страницы 
7.	CTRL+ALT+F форматировать выделенный код
8.	ALT+C закомментировать строки
9.	ALT+U раскомментировать строки
10.	ALT+X комментировать построчно (для PHP кода)
11.	F2 просмотреть страницу в браузере 
Посмотрите видео к уроку
</p>
        </div>
        </div>
        </div><br><a href="#">Далее...</a>
                        </div>
        </article>
    </div>
    </div>
</div>
</div>
</div>
                    </div>
                </div>
            </div>
